Revit 2027 API
ParameterTypeId.BoundaryDirectionRotX Property
 "X Rotation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryDirectionRotX { get; }
Public Shared ReadOnly Property BoundaryDirectionRotX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryDirectionRotX {
	ForgeTypeId^ get ();
}
static member BoundaryDirectionRotX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace